"espk" = "gniazdo głośników Apple";
"ispk" = "wbudowane";
"emic" = "gniazdo mikrofonu";
"imic" = "wbudowane";
"hdpn" = "gniazdo słuchawek";
"lini" = "gniazdo wejścia sygnału audio";
"lino" = "gniazdo wyjścia sygnału audio";
"spdi" = "gniazdo optyczne wejścia sygnału cyfrowego";
"spdo" = "gniazdo optyczne wyjścia sygnału cyfrowego";
"pci " = "karta PCI";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "urządzenie sieciowe";
"blue" = "Bluetooth";
"bluh" = "Słuchawki Bluetooth";
"blus" = "Zestaw słuchawkowy Bluetooth";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
